jiazhy-zhiyuan/WoBench/Github-Projects-Origin/Arduino-master/hardware/arduino/avr/bootloaders/lilypad/src/ATmegaBOOT.c.bak.c
	/* check for three times exclamation mark pressed */
	else if(ch=='!') {
	    ch = getch();
	    if(ch=='!') {
		ch = getch();
		if(ch=='!') {

#ifdef __AVR_ATmega128__
		    uint16_t extaddr;
#endif
		    uint8_t addrl, addrh;

#ifdef CRUMB128
		    PGM_P welcome = {"ATmegaBOOT / Crumb128 - (C) J.P.Kyle, E.Lins - 050815\n\r"};
#elif defined PROBOMEGA128
		    PGM_P welcome = {"ATmegaBOOT / PROBOmega128 - (C) J.P.Kyle, E.Lins - 050815\n\r"};
#elif defined SAVVY128
		    PGM_P welcome = {"ATmegaBOOT / Savvy128 - (C) J.P.Kyle, E.Lins - 050815\n\r"};
#endif

		    /* turn on LED */
		    LED_DDR |= _BV(LED);
		    LED_PORT &= ~_BV(LED);

		    /* print a welcome message and command overview */
		    for(i=0; welcome[i] != '\0'; ++i) {
			putch(welcome[i]);
		    }

		    /* test for valid commands */
		    for(;;) {
			putch('\n');
			putch('\r');
			putch(':');
			putch(' ');

			ch = getch();
			putch(ch);

			/* toggle LED */
			if(ch == 't') {
			    if(bit_is_set(LED_PIN,LED)) {
				LED_PORT &= ~_BV(LED);
				putch('1');
			    } else {
				LED_PORT |= _BV(LED);
				putch('0');
			    }

			} 

			/* read byte from address */
			else if(ch == 'r') {
			    ch = getch(); putch(ch);
			    addrh = gethex();
			    addrl = gethex();
			    putch('=');
			    ch = *(uint8_t *)((addrh << 8) + addrl);
			    puthex(ch);
			}

			/* write a byte to address  */
			else if(ch == 'w') {
			    ch = getch(); putch(ch);
			    addrh = gethex();
			    addrl = gethex();
			    ch = getch(); putch(ch);
			    ch = gethex();
			    *(uint8_t *)((addrh << 8) + addrl) = ch;

			}

			/* read from uart and echo back */
			else if(ch == 'u') {
			    for(;;) {
				putch(getch());
			    }
			}
#ifdef __AVR_ATmega128__
			/* external bus loop  */
			else if(ch == 'b') {
			    putch('b');
			    putch('u');
			    putch('s');
			    MCUCR = 0x80;
			    XMCRA = 0;
			    XMCRB = 0;
			    extaddr = 0x1100;
			    for(;;) {
				ch = *(volatile uint8_t *)extaddr;
				if(++extaddr == 0) {
				    extaddr = 0x1100;
				}
			    }
			}
#endif

			else if(ch == 'j') {
			    app_start();
			}

		    }
		    /* end of monitor functions */

		}
	    }
	}
	/* end of monitor */
#endif
	else if (++error_count == MAX_ERROR_COUNT) {
	    app_start();
	}
    }
    /* end of forever loop */

}


char gethex(void) {
    char ah,al;

    ah = getch(); putch(ah);
    al = getch(); putch(al);
    if(ah >= 'a') {
	ah = ah - 'a' + 0x0a;
    } else if(ah >= '0') {
	ah -= '0';
    }
    if(al >= 'a') {
	al = al - 'a' + 0x0a;
    } else if(al >= '0') {
	al -= '0';
    }
    return (ah << 4) + al;
}


void puthex(char ch) {
    char ah,al;

    ah = (ch & 0xf0) >> 4;
    if(ah >= 0x0a) {
	ah = ah - 0x0a + 'a';
    } else {
	ah += '0';
    }
    al = (ch & 0x0f);
    if(al >= 0x0a) {
	al = al - 0x0a + 'a';
    } else {
	al += '0';
    }
    putch(ah);
    putch(al);
}


void putch(char ch)
{
#ifdef __AVR_ATmega128__
    if(bootuart == 1) {
	while (!(UCSR0A & _BV(UDRE0)));
	UDR0 = ch;
    }
    else if (bootuart == 2) {
	while (!(UCSR1A & _BV(UDRE1)));
	UDR1 = ch;
    }
#elif defined __AVR_ATmega168__
    while (!(UCSR0A & _BV(UDRE0)));
    UDR0 = ch;
#else
    /* m8,16,32,169,8515,8535,163 */
    while (!(UCSRA & _BV(UDRE)));
    UDR = ch;
#endif
}


char getch(void)
{
#ifdef __AVR_ATmega128__
    if(bootuart == 1) {
	while(!(UCSR0A & _BV(RXC0)));
	return UDR0;
    }
    else if(bootuart == 2) {
	while(!(UCSR1A & _BV(RXC1)));
	return UDR1;
    }
    return 0;
#elif defined __AVR_ATmega168__
    uint32_t count = 0;
    while(!(UCSR0A & _BV(RXC0))){
    	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/               
    	/* HACKME:: here is a good place to count times*/
    	count++;
    	if (count > MAX_TIME_COUNT)
    		app_start();
     }
    return UDR0;
#else
    /* m8,16,32,169,8515,8535,163 */
    uint32_t count = 0;
    while(!(UCSRA & _BV(RXC))){
    	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/               
    	/* HACKME:: here is a good place to count times*/
    	count++;
    	if (count > MAX_TIME_COUNT)
    		app_start();
     }
    return UDR;
#endif
}


void getNch(uint8_t count)
{
    uint8_t i;
    for(i=0;i<count;i++) {
#ifdef __AVR_ATmega128__
	if(bootuart == 1) {
	    while(!(UCSR0A & _BV(RXC0)));
	    UDR0;
	} 
	else if(bootuart == 2) {
	    while(!(UCSR1A & _BV(RXC1)));
	    UDR1;
	}
#elif defined __AVR_ATmega168__
	while(!(UCSR0A & _BV(RXC0)));
	UDR0;
#else
	/* m8,16,32,169,8515,8535,163 */
   	/* 20060803 DojoCorp:: Addon coming from the previous Bootloader*/               
	//while(!(UCSRA & _BV(RXC)));
	//UDR;
    uint8_t i;
    for(i=0;i<count;i++) {
    	getch(); // need to handle time out
    }
#endif		
    }
}


void byte_response(uint8_t val)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(val);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}


void nothing_response(void)
{
    if (getch() == ' ') {
	putch(0x14);
	putch(0x10);
    } else {
	if (++error_count == MAX_ERROR_COUNT)
	    app_start();
    }
}

void flash_led(uint8_t count)
{
    /* flash onboard LED three times to signal entering of bootloader */
	/* l needs to be volatile or the delay loops below might get
	optimized away if compiling with optimizations (DAM). */
    volatile uint32_t l;

    if (count == 0) {
      count = 3;
    }
    
    for (i = 0; i < count; ++i) {
	LED_PORT |= _BV(LED);
	for(l = 0; l < (F_CPU / 1000); ++l);
	LED_PORT &= ~_BV(LED);
	for(l = 0; l < (F_CPU / 1000); ++l);
    }
}


/* end of file ATmegaBOOT.c */
